; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob20) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate3)
	(at pallet1 depot1)
	(clear crate8)
	(at pallet2 depot2)
	(clear crate1)
	(at pallet3 distributor0)
	(clear crate9)
	(at pallet4 distributor1)
	(clear crate5)
	(at pallet5 distributor2)
	(clear crate7)
	(at truck0 depot0)
	(at truck1 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 depot1)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 distributor1)
	(on crate4 pallet4)
	(at crate5 distributor1)
	(on crate5 crate4)
	(at crate6 distributor0)
	(on crate6 pallet3)
	(at crate7 distributor2)
	(on crate7 crate0)
	(at crate8 depot1)
	(on crate8 crate2)
	(at crate9 distributor0)
	(on crate9 crate6)
)

(:goal (and
		(on crate0 crate2)
		(on crate1 crate9)
		(on crate2 pallet2)
		(on crate3 crate1)
		(on crate4 crate0)
		(on crate5 pallet3)
		(on crate6 crate8)
		(on crate8 crate5)
		(on crate9 pallet1)
	)
))

; plan
1. (lift hoist9 crate7 crate0 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist9) (on crate7 crate0)
   added: (lifting hoist9 crate7) (clear crate0)
   goals met: 0 of 9
2. (lift hoist6 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist6) (on crate3 pallet0)
   added: (lifting hoist6 crate3) (clear pallet0)
   goals met: 0 of 9
3. (load hoist6 crate3 truck0 depot0)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck0) (available hoist6)
   goals met: 0 of 9
4. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 0 of 9
5. (unload hoist8 crate3 truck0 depot2)
   deleted: (in crate3 truck0) (available hoist8)
   added: (lifting hoist8 crate3)
   goals met: 0 of 9
6. (lift hoist7 crate8 crate2 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist7) (on crate8 crate2)
   added: (lifting hoist7 crate8) (clear crate2)
   goals met: 0 of 9
7. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 0 of 9
8. (load hoist7 crate8 truck1 depot1)
   deleted: (lifting hoist7 crate8)
   added: (in crate8 truck1) (available hoist7)
   goals met: 0 of 9
9. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 0 of 9
10. (lift hoist7 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist7) (on crate2 pallet1)
   added: (lifting hoist7 crate2) (clear pallet1)
   goals met: 0 of 9
11. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 0 of 9
12. (load hoist7 crate2 truck1 depot1)
   deleted: (lifting hoist7 crate2)
   added: (in crate2 truck1) (available hoist7)
   goals met: 0 of 9
13. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 0 of 9
14. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 0 of 9
15. (unload hoist4 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist4)
   added: (lifting hoist4 crate8)
   goals met: 0 of 9
16. (drop hoist4 crate8 crate5 distributor1)
   deleted: (lifting hoist4 crate8) (clear crate5)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 crate5)
   goals met: 1 of 9
17. (lift hoist2 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 1 of 9
18. (load hoist2 crate1 truck0 depot2)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck0) (available hoist2)
   goals met: 1 of 9
19. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 1 of 9
20. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 1 of 9
21. (unload hoist2 crate2 truck1 depot2)
   deleted: (in crate2 truck1) (available hoist2)
   added: (lifting hoist2 crate2)
   goals met: 1 of 9
22. (drop hoist2 crate2 pallet2 depot2)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (available hoist2) (at crate2 depot2) (clear crate2) (on crate2 pallet2)
   goals met: 2 of 9
23. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet5)
   added: (lifting hoist5 crate0) (clear pallet5)
   goals met: 2 of 9
24. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 2 of 9
25. (load hoist5 crate0 truck1 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck1) (available hoist5)
   goals met: 2 of 9
26. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 2 of 9
27. (unload hoist2 crate0 truck1 depot2)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 2 of 9
28. (drop hoist2 crate0 crate2 depot2)
   deleted: (lifting hoist2 crate0) (clear crate2)
   added: (available hoist2) (at crate0 depot2) (clear crate0) (on crate0 crate2)
   goals met: 3 of 9
29. (lift hoist3 crate9 crate6 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 crate6)
   added: (lifting hoist3 crate9) (clear crate6)
   goals met: 3 of 9
30. (load hoist3 crate9 truck0 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck0) (available hoist3)
   goals met: 3 of 9
31. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 3 of 9
32. (unload hoist7 crate1 truck0 depot1)
   deleted: (in crate1 truck0) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 3 of 9
33. (load hoist8 crate3 truck1 depot2)
   deleted: (lifting hoist8 crate3)
   added: (in crate3 truck1) (available hoist8)
   goals met: 3 of 9
34. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   goals met: 3 of 9
35. (unload hoist1 crate9 truck0 depot1)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   goals met: 3 of 9
36. (lift hoist3 crate6 pallet3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist3) (on crate6 pallet3)
   added: (lifting hoist3 crate6) (clear pallet3)
   goals met: 3 of 9
37. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 3 of 9
38. (load hoist7 crate1 truck0 depot1)
   deleted: (lifting hoist7 crate1)
   added: (in crate1 truck0) (available hoist7)
   goals met: 3 of 9
39. (drop hoist1 crate9 pallet1 depot1)
   deleted: (lifting hoist1 crate9) (clear pallet1)
   added: (available hoist1) (at crate9 depot1) (clear crate9) (on crate9 pallet1)
   goals met: 4 of 9
40. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 4 of 9
41. (unload hoist7 crate3 truck1 depot1)
   deleted: (in crate3 truck1) (available hoist7)
   added: (lifting hoist7 crate3)
   goals met: 4 of 9
42. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 4 of 9
43. (load hoist3 crate6 truck0 distributor0)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck0) (available hoist3)
   goals met: 4 of 9
44. (unload hoist3 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   goals met: 4 of 9
45. (drop hoist3 crate1 pallet3 distributor0)
   deleted: (lifting hoist3 crate1) (clear pallet3)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 pallet3)
   goals met: 4 of 9
46. (load hoist7 crate3 truck1 depot1)
   deleted: (lifting hoist7 crate3)
   added: (in crate3 truck1) (available hoist7)
   goals met: 4 of 9
47. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 4 of 9
48. (lift hoist3 crate1 pallet3 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist3) (on crate1 pallet3)
   added: (lifting hoist3 crate1) (clear pallet3)
   goals met: 4 of 9
49. (load hoist3 crate1 truck0 distributor0)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck0) (available hoist3)
   goals met: 4 of 9
50. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 4 of 9
51. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 4 of 9
52. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 4 of 9
53. (unload hoist7 crate1 truck0 depot1)
   deleted: (in crate1 truck0) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 4 of 9
54. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 4 of 9
55. (drop hoist7 crate1 crate9 depot1)
   deleted: (lifting hoist7 crate1) (clear crate9)
   added: (available hoist7) (at crate1 depot1) (clear crate1) (on crate1 crate9)
   goals met: 5 of 9
56. (unload hoist4 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist4)
   added: (lifting hoist4 crate6)
   goals met: 5 of 9
57. (load hoist4 crate6 truck1 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck1) (available hoist4)
   goals met: 5 of 9
58. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 5 of 9
59. (unload hoist7 crate3 truck1 depot1)
   deleted: (in crate3 truck1) (available hoist7)
   added: (lifting hoist7 crate3)
   goals met: 5 of 9
60. (drop hoist7 crate3 crate1 depot1)
   deleted: (lifting hoist7 crate3) (clear crate1)
   added: (available hoist7) (at crate3 depot1) (clear crate3) (on crate3 crate1)
   goals met: 6 of 9
61. (unload hoist1 crate6 truck1 depot1)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 6 of 9
62. (lift hoist4 crate8 crate5 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist4) (on crate8 crate5)
   added: (lifting hoist4 crate8) (clear crate5)
   goals met: 5 of 9
63. (load hoist4 crate8 truck0 distributor1)
   deleted: (lifting hoist4 crate8)
   added: (in crate8 truck0) (available hoist4)
   goals met: 5 of 9
64. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 5 of 9
65. (unload hoist7 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist7)
   added: (lifting hoist7 crate8)
   goals met: 5 of 9
66. (drop hoist7 crate8 crate3 depot1)
   deleted: (lifting hoist7 crate8) (clear crate3)
   added: (available hoist7) (at crate8 depot1) (clear crate8) (on crate8 crate3)
   goals met: 5 of 9
67. (lift hoist4 crate5 crate4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 crate4)
   added: (lifting hoist4 crate5) (clear crate4)
   goals met: 5 of 9
68. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 5 of 9
69. (load hoist4 crate5 truck1 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck1) (available hoist4)
   goals met: 5 of 9
70. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 5 of 9
71. (unload hoist3 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist3)
   added: (lifting hoist3 crate5)
   goals met: 5 of 9
72. (drop hoist3 crate5 pallet3 distributor0)
   deleted: (lifting hoist3 crate5) (clear pallet3)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 pallet3)
   goals met: 6 of 9
73. (lift hoist4 crate4 pallet4 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist4) (on crate4 pallet4)
   added: (lifting hoist4 crate4) (clear pallet4)
   goals met: 6 of 9
74. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 6 of 9
75. (load hoist4 crate4 truck1 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck1) (available hoist4)
   goals met: 6 of 9
76. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 6 of 9
77. (unload hoist8 crate4 truck1 depot2)
   deleted: (in crate4 truck1) (available hoist8)
   added: (lifting hoist8 crate4)
   goals met: 6 of 9
78. (drop hoist8 crate4 crate0 depot2)
   deleted: (lifting hoist8 crate4) (clear crate0)
   added: (available hoist8) (at crate4 depot2) (clear crate4) (on crate4 crate0)
   goals met: 7 of 9
79. (lift hoist7 crate8 crate3 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist7) (on crate8 crate3)
   added: (lifting hoist7 crate8) (clear crate3)
   goals met: 7 of 9
80. (load hoist7 crate8 truck0 depot1)
   deleted: (lifting hoist7 crate8)
   added: (in crate8 truck0) (available hoist7)
   goals met: 7 of 9
81. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 7 of 9
82. (unload hoist3 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist3)
   added: (lifting hoist3 crate8)
   goals met: 7 of 9
83. (drop hoist3 crate8 crate5 distributor0)
   deleted: (lifting hoist3 crate8) (clear crate5)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 crate5)
   goals met: 8 of 9
84. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 8 of 9
85. (load hoist1 crate6 truck0 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   goals met: 8 of 9
86. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 8 of 9
87. (unload hoist3 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist3)
   added: (lifting hoist3 crate6)
   goals met: 8 of 9
88. (drop hoist3 crate6 crate8 distributor0)
   deleted: (lifting hoist3 crate6) (clear crate8)
   added: (available hoist3) (at crate6 distributor0) (clear crate6) (on crate6 crate8)
   goals met: 9 of 9
